# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [15]:
data1 = pd.Series(np.random.randint(1,5,100))
data2 = pd.Series(np.random.randint(1,4,100))
data3 = pd.Series(np.random.randint(10000,30001,100))
print(data1)
print(data2)
print(data3)

0     2
1     4
2     3
3     2
4     2
5     2
6     1
7     1
8     1
9     1
10    4
11    4
12    2
13    4
14    3
15    3
16    4
17    3
18    3
19    3
20    4
21    4
22    3
23    2
24    2
25    2
26    1
27    4
28    3
29    1
     ..
70    4
71    2
72    4
73    4
74    1
75    2
76    4
77    1
78    4
79    3
80    1
81    2
82    1
83    3
84    3
85    3
86    3
87    1
88    3
89    1
90    3
91    1
92    3
93    3
94    4
95    1
96    2
97    4
98    4
99    2
Length: 100, dtype: int32
0     2
1     2
2     3
3     1
4     2
5     3
6     3
7     3
8     2
9     2
10    1
11    3
12    3
13    3
14    3
15    2
16    1
17    2
18    2
19    2
20    3
21    3
22    3
23    1
24    2
25    1
26    3
27    1
28    2
29    2
     ..
70    1
71    2
72    3
73    2
74    2
75    2
76    1
77    2
78    3
79    3
80    3
81    2
82    2
83    2
84    2
85    1
86    3
87    3
88    1
89    3
90    3
91    3
92    1
93    3
94    1
95    3
96    1
97    3
98    1
99    1
Length: 100, dtype: int32
0     20388
1     18460
2     16030
3     21682
4     21539
5     11740
6     13931
7     14377
8     28826
9     24429
10    27823
11    23346
12    14811
13    24794
14    19981
15    26237
16    27765
17    21340
18    25351
19    12336
20    23346
21    29547
22    14958
23    21627
24    18486
25    14349
26    10408
27    26675
28    17860
29    16726
      ...
70    10166
71    16751
72    19588
73    18851
74    28419
75    11022
76    19617
77    25693
78    13978
79    14257
80    18032
81    27916
82    20602
83    24708
84    26562
85    24872
86    26871
87    13497
88    10132
89    18322
90    13472
91    14932
92    13629
93    12961
94    25897
95    21031
96    11898
97    23402
98    21468
99    28685
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [21]:
data_col =  pd.concat([data1,data2,data3],axis=1).head()
data_col.head()

   0  1      2
0  2  2  20388
1  4  2  18460
2  3  3  16030
3  2  1  21682
4  2  2  21539

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [23]:
data_col.columns = ['bedrs','bathrs','price_sqr_meter']
data_col.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            20388
1      4       2            18460
2      3       3            16030
3      2       1            21682
4      2       2            21539

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [31]:
bigcolumn = pd.concat([data1,data2,data3])
bigcolumn.tail()

95    21031
96    11898
97    23402
98    21468
99    28685
dtype: int32

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [32]:
len(bigcolumn)
#Index are showing upto 99 only but the length of dataframe is showing 300

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [33]:
bigcolumn = pd.concat([data1,data2,data3],ignore_index=True)
bigcolumn.tail()

295    21031
296    11898
297    23402
298    21468
299    28685
dtype: int32